_site/2016-09-11-update-password-mannually-in-mantisbt.html


<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title>在 MantisBT 中使用管理员账号修改用户密码</title>
    
    <meta name="author" content="Kimi MA">

    <!-- Enable responsive viewport -->
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
    <![endif]-->

    <!-- Le styles -->
    <link href="assets/themes/twitter/bootstrap/css/bootstrap.2.2.2.min.css" rel="stylesheet">
    <link href="assets/themes/twitter/css/style.css?body=1" rel="stylesheet" type="text/css" media="all">
    <link rel="shortcut icon" type="image/ico" href="/assets/favicon.ico">
    <!-- Le fav and touch icons -->
  <!-- Update these with your own images
    <link rel="shortcut icon" href="images/favicon.ico">
    <link rel="apple-touch-icon" href="images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="images/apple-touch-icon-114x114.png">
  -->

    <!-- atom & rss feed -->
    <link href="/atom.xml" type="application/atom+xml" rel="alternate" title="Sitewide ATOM Feed">
    <link href="/rss.xml" type="application/rss+xml" rel="alternate" title="Sitewide RSS Feed">

  </head>

  <body>
    <div class="navbar navbar-fixed-top">
      <div class="navbar-inner">
        <div class="container-narrow">
          <a class="brand" href="/">Die Welt ist meine Vorstellung</a>
          <ul class="nav">
            
            
            


  
    
      
    
  
    
      
      	
      	<li><a href="/archive">Archive</a></li>
      	
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/categories">Topics</a></li>
      	
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/tags">Tags</a></li>
      	
      
    
  



          </ul>
        </div>
      </div>
    </div>

    <div class="container-narrow">

      <div class="content">
        

<div class="page-header">
  <h1>在 MantisBT 中使用管理员账号修改用户密码 </h1>
</div>

<div class="row-fluid post-full">
  <div class="span12">
    <div class="date">
      <span>11 September 2016</span>
    </div>
    <div class="content">
      <div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 再见 Bugfree</h2>
<div class="outline-text-2" id="text-1">
<p>
最近在本地一直用的缺陷管理工具 bugfree<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> 没法用了。原因有两点：第一，我们的
IT 管理员最近升级了 PHP 导致依赖老版本的 PHP 的 bugfree 跑不起来了；第二，
bugfree 官网说不在继续开发维护了，他们转向开发禅道了，公告如下：
</p>

<blockquote>
<p>
感谢您对BugFree的支持，我们现在向您推荐我们团队全新的产品——禅道项目管理软件。禅道是我们历时三年精心打造的一款完整的项目管理软件，涵盖了需求管理、任务管理、缺陷管理和用例管理，是研发类项目管理的必备软件！ BugFree项目以后将不再有任何更新，我们也不再提供任何技术支持。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 拥抱 MantisBT</h2>
<div class="outline-text-2" id="text-2">
<p>
所以，开发团队在内部外部都得不到有效的支持，就只好切换了工具了。在浩瀚如烟的缺陷管理工具中寻寻觅觅，终于选定了这只捕虫专家螳螂 MantisBT<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>。Mantis 简洁高效使用方便，还有一个不错的 changelog 和 milestone 管理界面，实在是难得的一个好工具。请看官网介绍及用户评价：
</p>

<blockquote>
<p>
MantisBT makes collaboration with team members &amp; clients easy, fast, and
professional.
</p>

<p>
"We've come to respect mantis for its powerful simplicity and I go around
recommending it to friends and clients alike."
</p>

<p>
&#x2013; John Zastrow / Tetra Tech, Inc.
</p>

<p>
"Great product! We tried 6 different issue trackers before settling on Mantis."
</p>

<p>
&#x2013; John Locke / Freelock Computing
</p>

<p>
"Very flexible great project, exactly what we need for our software
development."
</p>

<p>
&#x2013; Attila Strba / EnOcean
</p>
</blockquote>

<p>
之所以选择它，还有另外一个原因，就是我一直在用的开源文件管理程序叫 Double
Commander（DC）<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> 也是用 MantisBT 管理缺陷和需求的。
</p>

<p>
如果想对 MantisBT 有个直观的了解可以点开 DC 的问题单管理页面查看：
<a href="http://doublecmd.sourceforge.net/mantisbt/view_all_bug_page.php">http://doublecmd.sourceforge.net/mantisbt/view_all_bug_page.php</a>
</p>

<p>
另外，也你也可以看到 DC 团队是如何用 MantisBT 管理 roadmap 的：
<a href="http://doublecmd.sourceforge.net/mantisbt/roadmap_page.php">http://doublecmd.sourceforge.net/mantisbt/roadmap_page.php</a>
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> 安装配置 MantisBT</h2>
<div class="outline-text-2" id="text-3">
<p>
我下载安装的是 1.3.1 版本的 MantisBT，在安装了 XAMPP<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> 的机器上安装MantisBT
简直是小菜一碟，只要几下鼠标就可以了。相对来说配置稍微麻烦一些，如果需要简单的定制你得做这些事情：
</p>

<ul class="org-ul">
<li>创建项目，MantisBT 支持多个项目</li>
<li>添加自定义的输入域，用来支持额外的缺陷信息，比如缺陷发现的阶段等</li>
<li>设置并简化缺陷状态变迁表，默认的状态变迁表比较繁琐，有 feedback，acknowledge
等，可以精简掉，只保留 new，assigned，resolved，close</li>
<li>添加用户，并将用户关联到项目</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> 修改用户密码</h2>
<div class="outline-text-2" id="text-4">
<p>
但是问题来了，新添加的用户密码不能手动更改，系统会发一封邮件给新用户，让她/他用随机密码登陆自己去设置新密码。但是配置 SMTP 邮箱服务器又很繁琐，只好想办法通过管理员账户手动修改。
</p>

<p>
参考了以往用户的经验总结之后，修改了两个文件，成功在最新版本的 MantisBT 上实现手动修改用户密码功能。
</p>

<p>
首先，请确保使用的 MantisBT 版本为 =1.3.1=，不然的话文件内容可能不太一样，但是基本上也差不了多少，我就是参考了 simon-杨<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>的文章修改的，他是 2013 年 2 月 26
日写的，所以面向的是比较老的版本，有不少差异，感兴趣的朋友可以对比一下。
</p>

<p>
然后，在 <code>manage_user_edit_page.php</code> 文件中找到 <code>&lt;!-- Access Level --&gt;</code> ，在其上方添加：
</p>

<div class="org-src-container">

<pre class="src src-html"><span style="color: #228b22; font-style: italic;">&lt;!-- </span><span style="color: #228b22; font-style: italic;">Password </span><span style="color: #228b22; font-style: italic;">--&gt;</span>
&lt;<span style="color: #0000cd;">div</span> <span style="color: #0000ff; font-style: italic;">class</span>=<span style="color: #3a5fcd;">"field-container"</span>&gt;
    &lt;<span style="color: #0000cd;">label</span> <span style="color: #0000ff; font-style: italic;">for</span>=<span style="color: #3a5fcd;">"edit-password"</span>&gt;&lt;<span style="color: #0000cd;">span</span>&gt;&lt;<span style="color: #8b008b; font-weight: bold;">?php</span> echo <span style="color: #3a5fcd;">"Password (change only)"</span> ?&gt;&lt;/<span style="color: #0000cd;">span</span>&gt;&lt;/<span style="color: #0000cd;">label</span>&gt;
    &lt;<span style="color: #0000cd;">span</span> <span style="color: #0000ff; font-style: italic;">class</span>=<span style="color: #3a5fcd;">"input"</span>&gt;&lt;<span style="color: #0000cd;">input</span> <span style="color: #0000ff; font-style: italic;">id</span>=<span style="color: #3a5fcd;">"edit-password"</span> <span style="color: #0000ff; font-style: italic;">type</span>=<span style="color: #3a5fcd;">"text"</span> <span style="color: #0000ff; font-style: italic;">size</span>=<span style="color: #3a5fcd;">"32"</span> <span style="color: #0000ff; font-style: italic;">maxlength</span>=<span style="color: #3a5fcd;">"100"</span> <span style="color: #0000ff; font-style: italic;">name</span>=<span style="color: #3a5fcd;">"password"</span> <span style="color: #0000ff; font-style: italic;">value</span>=<span style="color: #3a5fcd;">""</span> /&gt;&lt;/<span style="color: #0000cd;">span</span>&gt;
    &lt;<span style="color: #0000cd;">span</span> <span style="color: #0000ff; font-style: italic;">class</span>=<span style="color: #3a5fcd;">"label-style"</span>&gt;&lt;/<span style="color: #0000cd;">span</span>&gt;
&lt;/<span style="color: #0000cd;">div</span>&gt;
<span style="color: #228b22; font-style: italic;">&lt;!-- </span><span style="color: #228b22; font-style: italic;">Access Level </span><span style="color: #228b22; font-style: italic;">--&gt;</span>
</pre>
</div>

<p>
接着，在 <code>manage_user_update.php</code> 的 74 行左右的地方找到：
</p>

<div class="org-src-container">

<pre class="src src-C">$f_user_id      = gpc_get_int( <span style="color: #3a5fcd;">'user_id'</span> );
</pre>
</div>

<p>
在其下方增加 <code>$f_pass       = gpc_get_string('password');</code>
</p>
<div class="org-src-container">

<pre class="src src-C">$f_user_id      = gpc_get_int( <span style="color: #3a5fcd;">'user_id'</span> );
$f_pass       = gpc_get_string(<span style="color: #3a5fcd;">'password'</span>);
</pre>
</div>

<p>
最后，找到
</p>

<div class="org-src-container">

<pre class="src src-C">$t_result = db_query( $t_query, $t_query_params );
</pre>
</div>

<p>
在这句后面添加几行：
</p>

<div class="org-src-container">

<pre class="src src-C">$t_result = db_query( $t_query, $t_query_params );
<span style="color: #228b22; font-style: italic;">//</span><span style="color: #228b22; font-style: italic;">Reset the password if specified.</span>
<span style="color: #8b008b; font-weight: bold;">if</span> ($f_pass) user_set_password($f_user_id, $f_pass);
event_signal( <span style="color: #3a5fcd;">'EVENT_MANAGE_USER_UPDATE'</span>, array( $c_user_id ) );
</pre>
</div>

<p>
然后刷新一下用户编辑页面就能修改用户密码啦。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.bugfree.cn/">http://www.bugfree.cn/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.mantisbt.org/">http://www.mantisbt.org/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="http://doublecmd.sourceforge.net/">http://doublecmd.sourceforge.net/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.apachefriends.org">https://www.apachefriends.org</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<a href="http://blog.csdn.net/simongyley/article/details/8612728">http://blog.csdn.net/simongyley/article/details/8612728</a>
</p></div></div>


</div>
</div>

    </div>

  
    <ul class="tag_box inline">
      <li><i class="icon-folder-open"></i></li>
      
      


  
     
    	<li><a href="/categories.html#productivity-ref">
    		productivity <span>21</span>
    	</a></li>
    
  


    </ul>
    

  
    <ul class="tag_box inline">
      <li><i class="icon-tags"></i></li>
      
      


  
     
    	<li><a href="/tags.html#tools-ref">tools <span>2</span></a></li>
     
    	<li><a href="/tags.html#productivity-ref">productivity <span>2</span></a></li>
    
  



    </ul>
    

    <hr>
    <div class="pagination">
      <ul>
      
        <li class="prev"><a href="/2016-09-06-english-daylily" title="单词本：蔬菜之黄花菜">&larr; Previous</a></li>
      
        <li><a href="/archive.html">Archive</a></li>
      
        <li class="next"><a href="/2016-09-12-english-bamboo-shoots" title="单词本：蔬菜之竹笋">Next &rarr;</a></li>
      
      </ul>
    </div>
    <hr>
    


  <!-- Duoshuo Comment BEGIN -->
	<div class="ds-thread"></div>
<script type="text/javascript">
var duoshuoQuery = {short_name:"kimim"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = 'http://static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		|| document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
<!-- Duoshuo Comment END -->





  </div>
</div>


      </div>
      <hr>
      <footer>
        <p>&copy; 2018 Kimi MA,
           All right reserved.
        </p>
      </footer>

    </div>

    
  </body>
</html>

